## Ques1:- Read the housingdata.csv file into pandas DataFrame and display first six rows of the DataFrame

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
data=pd.read_csv("housingdata.csv")
data.head(6)

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
2  100003000.0           AP    2541654          NaN        1   850
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
5  100006000.0           TN   65465466          NaN        1   800

## Ques2:- Display the column names and row index in separate cells.

In [3]:
data.columns

Index(['PID', 'STATE', 'PRICE', 'NUM_BEDROOMS', 'NUM_BATH', 'SQ_FT'], dtype='object')

In [4]:
data.index

RangeIndex(start=0, stop=9, step=1)

## Ques3(a) :- How many numbers of "STATE" exist in the dataset.

In [5]:
data["STATE"].aggregate(["count"])

count    9
Name: STATE, dtype: int64

## Ques3(b) :- How many unique states exist in the dataset

In [6]:
pd.unique(data["STATE"]).shape

(6,)

## Ques4: - Retrieve the list of all NaN/Null/Empty cells in the form of Boolean list

In [7]:
data=pd.read_csv("housingdata.csv")
data["NUM_BEDROOMS"] = pd.to_numeric(data["NUM_BEDROOMS"], errors="coerce")
data["SQ_FT"] = pd.to_numeric(data["SQ_FT"], errors="coerce")
data.isnull()

     PID  STATE  PRICE  NUM_BEDROOMS  NUM_BATH  SQ_FT
0  False  False  False         False     False  False
1  False  False  False         False     False   True
2  False  False  False          True     False  False
3  False  False  False         False      True  False
4   True  False  False         False     False  False
5  False  False  False          True     False  False
6  False  False  False         False     False  False
7  False  False  False         False     False   True
8  False  False  False          True     False  False

## Ques5: - Drop all rows with N/A,NA,na values in Num_Bedrooms

In [8]:
data=pd.read_csv("housingdata.csv")
data["NUM_BEDROOMS"] = pd.to_numeric(data["NUM_BEDROOMS"], errors="coerce").fillna(0).astype(int)
data.groupby(data["NUM_BEDROOMS"]).get_group(0)

           PID STATE     PRICE  NUM_BEDROOMS NUM_BATH SQ_FT
2  100003000.0    AP   2541654             0        1   850
5  100006000.0    TN  65465466             0        1   800
8  100009000.0    HP     21212             0        2  1800

## Ques6:- Replace the NAN and string entries in Num_Bath with previous entry

In [9]:
data=pd.read_csv("housingdata.csv")
data["NUM_BATH"] = pd.to_numeric(data["NUM_BATH"], errors="coerce")
data.fillna(method="ffill")

           PID        STATE      PRICE NUM_BEDROOMS  NUM_BATH SQ_FT
0  100001000.0           MP     321654            3       1.0  1000
1  100002000.0  MAHARASHTRA      21325            3       1.5    --
2  100003000.0           AP    2541654            3       1.0   850
3  100004000.0           TN     321321            1       1.0   700
4  100004000.0           TN  589465645            3       2.0  1600
5  100006000.0           TN   65465466            3       1.0   800
6  100007000.0        ASSAM    3222321            2       1.0   950
7  100008000.0           HP      23131            1       1.0   950
8  100009000.0           HP      21212           na       2.0  1800

## Ques7:- Replace the empty values in "SQ_FT" with the mean of the all entries.

In [10]:
data=pd.read_csv("housingdata.csv")
data["SQ_FT"] = pd.to_numeric(data["SQ_FT"], errors="coerce")
mean=data["SQ_FT"].mean()
print("mean of the all entries of the SQ_FT =",mean)
data["SQ_FT"].fillna(mean)

mean of the all entries of the SQ_FT = 1100.0

0    1000.0
1    1100.0
2     850.0
3     700.0
4    1600.0
5     800.0
6     950.0
7    1100.0
8    1800.0
Name: SQ_FT, dtype: float64

## Ques8:- What is the sum of SQ_FT of all entries in the dataset

In [11]:
data=pd.read_csv("housingdata.csv")
data["SQ_FT"] = pd.to_numeric(data["SQ_FT"], errors="coerce")
sum=data["SQ_FT"].sum()
print("sum of SQ_FT of all entries in the dataset =",sum)

sum of SQ_FT of all entries in the dataset = 7700.0

## Ques9:- Add a new column "NUM_STORE" and with all the values as 1 for all rows.

In [12]:
data=pd.read_csv("housingdata.csv")
data["NUM_STORE"]=data["SQ_FT"].apply(lambda x:1)
data

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT  NUM_STORE
0  100001000.0           MP     321654            3        1  1000          1
1  100002000.0  MAHARASHTRA      21325            3      1.5    --          1
2  100003000.0           AP    2541654          NaN        1   850          1
3  100004000.0           TN     321321            1      NaN   700          1
4          NaN           TN  589465645            3        2  1600          1
5  100006000.0           TN   65465466          NaN        1   800          1
6  100007000.0        ASSAM    3222321            2   HURLEY   950          1
7  100008000.0           HP      23131            1        1   NaN          1
8  100009000.0           HP      21212           na        2  1800          1

## Ques10: - Create a DataFrame containing all entries of TN state only

In [13]:
data=pd.read_csv("housingdata.csv")
data.groupby(data["STATE"]).get_group("TN")

           PID STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
3  100004000.0    TN     321321            1      NaN   700
4          NaN    TN  589465645            3        2  1600
5  100006000.0    TN   65465466          NaN        1   800

## Ques11:- Create a DataFrame having SQ_FT area greater than 1000 and display the DataFrame

In [14]:
data=pd.read_csv("housingdata.csv")
data["SQ_FT"] = pd.to_numeric(data["SQ_FT"], errors="coerce")
data.loc[(data["SQ_FT"]>1000)]

           PID STATE      PRICE NUM_BEDROOMS NUM_BATH   SQ_FT
4          NaN    TN  589465645            3        2  1600.0
8  100009000.0    HP      21212           na        2  1800.0

## Ques12:- Create a DataFrame having only first Three columns and First Three rows

In [15]:
data.iloc[0:3,0:3]

           PID        STATE    PRICE
0  100001000.0           MP   321654
1  100002000.0  MAHARASHTRA    21325
2  100003000.0           AP  2541654

## Ques13:- Display the state having highest average price per square foot of housing area.

In [16]:
data=pd.read_csv("housingdata.csv")
data["SQ_FT"] = pd.to_numeric(data["SQ_FT"], errors="coerce")
data["AVERAGE_PRICE"]=data["PRICE"]/data["SQ_FT"]
data.loc[data["AVERAGE_PRICE"].idxmax()]

PID                        NaN
STATE                       TN
PRICE                589465645
NUM_BEDROOMS                 3
NUM_BATH                     2
SQ_FT                   1600.0
AVERAGE_PRICE    368416.028125
Name: 4, dtype: object